INSERT INTO Users(user_id, name, surname, email, phone_number, address, region) VALUES
('1', 'Марина', 'Павленко', 'pavlenkomarina@gmail.com', '+380686439201', 'вул. Петра Дорошенка', 'Львів'),
('2', 'Тимофій', 'Кузьменко', 'timofiikuzmenko@gmail.com', '+380974437301', 'вул. Степова', 'Одеса'),
('3', 'Матильда', 'Петренко', 'matildapetrenko@gmail.com', '+380681134387', 'вул. Срібнокільська 12', 'Київ');

INSERT INTO Category(category_name) VALUES
('Побутова техніка'),
('Шкільне приладдя'),
('Книги');

INSERT INTO Product(product_name, info, price, categories) VALUES
('Пральна машина', 'Пральна машина Midea', '8999', 'Побутова техніка'),
('Набір зошитів Kite', 'Набір зошитів Kite 48+24 аркушів 10 шт', '290', 'Шкільне приладдя'),
('Я бачу вас цікавить пітьма', 'Я бачу вас цікавить пітьма; Автор - Ілларіон', '600', 'Книги'),
('Електричний чайник', 'Електричний чайник Gorenje K15DWW', '899.99', 'Побутова техніка');

INSERT INTO Delivery(delivery_method, delivery_address, order_status) VALUES
('Кур`єр', 'вул. Срібнокільська 12', 'В дорозі'),
('В віділення нової пошти', 'вул. Шевченка 321', 'Доставлено'),
('В віділення укр пошти', 'вул. Преображенська 83', 'Скасовано'),
('В віділення нової пошти', 'просп. Григоренка Петра 22/20', 'В дорозі'),
('В віділення нової пошти', 'вул. Преображенська 84', 'В дорозі');

INSERT INTO Payment(transaction_date, payment_method, payment_status) VALUES
('2025-12-03 00:00:00', 'Готівка', 'Чекає на оплату'),
('2025-10-20 12:23:11', 'Картка', 'Оплачено'),
('2025-10-23 19:10:09', 'Картка', 'Повернення коштів'),
('2025-10-22 12:33:38', 'Картка', 'Оплачено'),
('2025-12-04 00:00:00', 'Готівка', 'Чекає на оплату');

INSERT INTO Orders(order_id, total_price, delivery_date, cart_id, delivery_id, payment_id, status) VALUES
('1', '432.99', '2025-12-04', '2', '5', '11','В дорозі'),
('2', '15000', '2025-10-20', '3', '6', '12', 'Доставлено'),
('3', '234.60', '2025-10-20', '4', '7', '13', 'Скасовано'),
('4', '431', '2025-10-22', '5', '8', '14', 'В дорозі'),
('5', '998.88', '2025-12-06', '6', '10', '15', 'В дорозі');

INSERT INTO Cart(user_id, items) VALUES
('1', 'пусто'),
('2', 'пусто'),
('3', 'пусто'),
('1005', 'пусто'),
('1006', 'пусто');